driver-tests/recovery/CorrelationSampleJBI/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cor="http://xml.netbeans.org/schema/CorrelationSample">
  <soapenv:Body>
    <cor:CSInput>
      <cor:InMessage>Filed1</cor:InMessage>
      <cor:Id>Field2</cor:Id>
    </cor:CSInput>
  </soapenv:Body>
</soapenv:Envelope>